src/DataProcessors/ЗаменаКартыКеГеЛьБУМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗаменаКартыКеГеЛьБУМ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКеГеЛьБУМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыКартДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКартДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Временная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ЗаменаКартыКеГеЛьБУМ/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

Функция ОткрытьФормуЗаменыКарты() Экспорт

	ПравоДоступа = ПланыВидовХарактеристик.ПраваДоступа.ЗаменаКартыКеГеЛьБУМ;
	
	Если НЕ ИнтерфейсРМ.ПроверкаПраваДоступа(ПравоДоступа) Тогда
		Текст1="Недостаточно прав!";
		Текст2="Отказано в праве доступа:
		|"""+ПравоДоступа.Наименование+"""";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");

		Возврат Ложь;
	КонецЕсли; 
	
	ВыбКартаДоступа	= Неопределено;
	ВыбКлиент 		= ИнтерфейсРМ.ИдентификацияКлиента( , Истина, Истина, ВыбКартаДоступа );
	
	Если ВыбКлиент=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВыбКартаДоступа=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбКартаДоступа.ТипКарты) Тогда
	    Текст1="Это не постоянная карта!";
		Текст2="У считанной карты не указан тип!"; 
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	ИначеЕсли ВыбКартаДоступа.ТипКарты <> Перечисления.ТипыКартДоступа.Постоянная Тогда
		Текст1="Это не постоянная карта!";
		Текст2="Считана "+ВыбКартаДоступа.ТипКарты+",
		|а не постоянная карта клиента!"; 
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	КонецЕсли; 

	Клиент					= ВыбКлиент;
	КартаДоступа			= ВыбКартаДоступа;
	ИдентификаторКеГеЛьБУМ	= "";

	ФормаВыбора = ПолучитьФорму("Форма");
	ФормаВыбора.Открыть();

	Возврат Истина;
	
КонецФункции
 

#КонецЕсли
